app/controllers/book_comments_controller.rb

  def baria_user
    unless BookComment.find_by(id: params[:id], book_id: params[:book_id]).user == current_user
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]