app/controllers/relationships_controller.rb

    def create
      follow = current_user.active_relationships.build(followed_id: params[:user_id])
      follow.save
---
INSERT INTO "relationships" ("follower_id", "followed_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["follower_id", 3], ["followed_id", 2], ["created_at", "2021-05-07 10:18:38.133554"], ["updated_at", "2021-05-07 10:18:38.133554"]]

    def destroy
      unfollow = current_user.active_relationships.find_by(followed_id: params[:user_id]).destroy
---
DELETE FROM "relationships" WHERE "relationships"."id" = ?  [["id", 1]]