app/controllers/users_controller.rb

  def update
    if @user.update(user_params)
---
UPDATE "users" SET "name" = ?, "introduction" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "hct5ygqa1"], ["introduction", "4ktneg63ia1z6lm0qlj"], ["updated_at", "2021-05-01 21:06:56.726206"], ["id", 2]]

    def ensure_correct_user
      @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]